## `terraform plan`

From the [Azure pipeline run](https://calenterprise.visualstudio.com/CDT.OET.CAL-ITP/_build/results?buildId=45564&view=logs&j=5af648c4-4294-55a7-6072-dd70820d3dba&t=42899ae2-6397-58a2-7641-cec3214b180b), none of this is really a surprise since changing some of these settings causes the whole block to be recreated:

```log
Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
-/+ destroy and then create replacement

Terraform will perform the following actions:

  # azurerm_app_service_source_control.main must be replaced
-/+ resource "azurerm_app_service_source_control" "main" {
      ~ id                     = "/subscriptions/xxx/resourceGroups/RG-CDT-PUB-VIP-CALITP-D-001/providers/Microsoft.Web/sites/AS-CDT-PUB-VIP-CALITP-D-001" -> (known after apply)
      ~ scm_type               = "GitHub" -> (known after apply)
      ~ use_manual_integration = false -> true # forces replacement
      ~ uses_github_action     = false -> (known after apply)
        # (6 unchanged attributes hidden)

      + github_action_configuration { # forces replacement
          + generate_workflow_file = false # forces replacement
          + linux_action           = (known after apply)

          + container_configuration {
              + image_name   = "cal-itp/benefits" # forces replacement
              + registry_url = "https://ghcr.io/" # forces replacement
            }
        }
    }

Plan: 1 to add, 0 to change, 1 to destroy.
```